package org.example._2024_03_04;

/*Задание 1
 Создайте класс Concatenation
 Создайте две переменные типа String
 Примените конкатенацию строк и выведите результат в консоль.
 Скомпилируйте созданную программу.
 Запустите программу в терминале.*/
public class Concatenation {
    public static void main(String[] args) {
        String string1 = "Конкатенация";
        String string2 = "строк";
        System.out.println(string1+" " +string2);

    }
}
